Vadim139/ARM/STM32F407/Test_f407/src/STM32F3_my.c
/*
 * STM32F3_my.c
 *
 *  Created on: Oct 23, 2013
 *      Author: Dawid
 */

#include "stm32f4xx.h"
#include "stm32f4_discovery.h"
#include "stm32f4xx_it.h"
#include "STM32F3_my.h"
#include "common.h"
#include "stm32f4xx_syscfg.h"
#include "stm32f4xx_exti.h"
#include "PCF8583.h"
#include "lcdlib.h"


void GPIO_PinInit(GPIO_TypeDef* Port, uint16_t Pin, GPIOMode_TypeDef Mode, GPIOOType_TypeDef Type, GPIOPuPd_TypeDef PuPd, GPIOSpeed_TypeDef Speed)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /* Enable the GPIO_LED Clock */
  switch ((uint32_t)Port) {
	case GPIOA_BASE :
		RCC_AHB1PeriphClockCmd((uint32_t)RCC_AHB1Periph_GPIOA, ENABLE);
		break;
	case GPIOB_BASE :
		RCC_AHB1PeriphClockCmd((uint32_t)RCC_AHB1Periph_GPIOB, ENABLE);
		break;
	case GPIOC_BASE :
		RCC_AHB1PeriphClockCmd((uint32_t)RCC_AHB1Periph_GPIOC, ENABLE);
		break;
	case GPIOD_BASE :
		RCC_AHB1PeriphClockCmd((uint32_t)RCC_AHB1Periph_GPIOD, ENABLE);
		break;
	case GPIOE_BASE :
		RCC_AHB1PeriphClockCmd((uint32_t)RCC_AHB1Periph_GPIOE, ENABLE);
		break;
	default:
		break;
}


  /* Configure the GPIO pin */
  GPIO_InitStructure.GPIO_Pin = Pin;
  GPIO_InitStructure.GPIO_Mode = Mode;
  if (Mode == GPIO_Mode_OUT)
	  GPIO_InitStructure.GPIO_OType = Type;
  GPIO_InitStructure.GPIO_PuPd = PuPd;
  GPIO_InitStructure.GPIO_Speed = Speed;
  GPIO_Init(Port, &GPIO_InitStructure);
}


void GPIO_PinSet(GPIO_TypeDef* Port, uint16_t Pin)
{
	Port -> BSRRL = Pin;
}

void GPIO_PinRes(GPIO_TypeDef* Port, uint16_t Pin)
{
	Port -> BSRRH = Pin;
}

void GPIO_PinTog(GPIO_TypeDef* Port, uint16_t Pin)
{
	Port -> ODR ^= Pin;
}

void GPIO_PinOut(GPIO_TypeDef* Port, uint16_t Pin)
{
	GPIO_PinInit(Port,Pin,GPIO_Mode_OUT,GPIO_OType_PP, GPIO_PuPd_UP, GPIO_Speed_50MHz);
}

void GPIO_PinIn(GPIO_TypeDef* Port, uint16_t Pin)
{
	GPIO_PinInit(Port, Pin, GPIO_Mode_IN,GPIO_OType_PP, GPIO_PuPd_UP, GPIO_Speed_50MHz);
}

uint32_t GPIO_GetState(GPIO_TypeDef* Port, uint16_t Pin)
{
  return GPIO_ReadInputDataBit(Port,Pin);
}

//	Inicjalizacja led'ów
void LED_init(void) {
	STM_EVAL_LEDInit(LED3);
	STM_EVAL_LEDInit(LED4);// 1s = 72000000  2s = 72000000 * 2
	STM_EVAL_LEDInit(LED5);// 1 ms = 72000  1 qs = 72
	STM_EVAL_LEDInit(LED6);


	LED3_off;
	LED4_off;
	LED5_off;
	LED6_off;

}

void LEDs_off(void) {
	LED3_off;
	LED4_off;
	LED5_off;
	LED6_off;

}

void LEDs_on(void) {
	LED3_on;
	LED4_on;
	LED5_on;
	LED6_on;

}

//	Delay'e pod 72 MHz - nieczynne
void delay_s (uint32_t s)
{
	_delay_ms(1000 * s);
//	uint32_t i;
//	s *= 6000000;
//	for(i = 0; i < s; i++);
}

void delay_ms (uint32_t ms)
{
	uint32_t i;
	ms = 6000 * ms;
	for(i = 0; i < ms; i++);
}

void delay_qs (uint16_t qs)
{
	uint16_t i;
	qs *= 6;
	for(i = 0; i < qs; i++);
}

void delay (uint16_t qs)
{
	uint16_t i;
	for(i = 0; i < qs; i++);
}

void EXTI_Config(GPIO_TypeDef* Port, uint16_t Pin, EXTITrigger_TypeDef Mode)
{

	  EXTI_InitTypeDef   EXTI_InitStructure;
	  GPIO_InitTypeDef   GPIO_InitStructure;
	  NVIC_InitTypeDef   NVIC_InitStructure;

	  uint8_t i = 0;
	  uint32_t PinN = 0;

	  /* Configure EXTI0 line */
		    PinN = Pin;
		    for(;PinN != 1; )
		    	{
		    	i++;
		    	PinN = PinN/2;
	//	    	Pin = i;
		    	}


	  /* Enable GPIO clock */
	  /* Connect EXTI0 Line to pin */
	    switch ((uint32_t)Port) {
	    	case GPIOA_BASE :
	    		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
	  	   	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	    		SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, (uint8_t)i);
	    		break;
	    	case GPIOB_BASE :
	    		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	  	   	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	    		SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, (uint8_t)i);
	    		break;
	    	case GPIOC_BASE :
	    		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	  	   	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	    		SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC, (uint8_t)i);
	    		break;
	    	case GPIOD_BASE :
	    		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
	  	   	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	    		SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOD, (uint8_t)i);
	    		break;
	    	case GPIOE_BASE :
	    		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
	  	   	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	    		SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOE, (uint8_t)i);
	    		break;
	    	default:
	    		break;
	    }

		  /* Enable SYSCFG clock */
//		  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

//	  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

	  /* Configure PA0 pin as input floating */
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	  GPIO_InitStructure.GPIO_Pin = Pin;
	  GPIO_Init(Port, &GPIO_InitStructure);




//	  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource0);

//	  /* Configure EXTI0 line */
//	    PinN = Pin;
//	    for(;PinN != 1; )
//	    	{
//	    	i++;
//	    	PinN = PinN/2;
////	    	Pin = i;
//	    	}

	  EXTI_InitStructure.EXTI_Line = Pin;
	  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	  EXTI_InitStructure.EXTI_Trigger = Mode;
	  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	  EXTI_Init(&EXTI_InitStructure);

	  /* Enable and set EXTI0 Interrupt to the lowest priority */
	  if((uint8_t)i == 0)
		  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
	  else if((uint8_t)i == 1)
		  NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
	  else if((uint8_t)i == 2)
		  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;
	  else if((uint8_t)i == 3)
		  NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;
	  else if((uint8_t)i == 4)
		  NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn;
	  else if((uint8_t)i == 5 || 6 || 7 || 8 || 9)
		  NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
	  else if((uint8_t)i == 10 || 11 || 12 || 13 || 14 || 15)
		  NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;

	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x00;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x00;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	  NVIC_Init(&NVIC_InitStructure);

