Vadim139/ARM/STM32F407/Test_f407/src/STM32F3_my.c
	}
	else if (channel == 2)
	{
		TIM_OC1Init(TIM8, &TIM_OCInitStructure);
		TIM_OC2Init(TIM8, &TIM_OCInitStructure);
	}
	else if (channel == 3)
	{
		TIM_OC1Init(TIM8, &TIM_OCInitStructure);
		TIM_OC2Init(TIM8, &TIM_OCInitStructure);
		TIM_OC3Init(TIM8, &TIM_OCInitStructure);
	}
	else if (channel == 4)
	{
		TIM_OC1Init(TIM8, &TIM_OCInitStructure);
		TIM_OC2Init(TIM8, &TIM_OCInitStructure);
		TIM_OC3Init(TIM8, &TIM_OCInitStructure);
//		TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
		TIM_OC4Init(TIM8, &TIM_OCInitStructure);
	}

	TIM_ARRPreloadConfig(TIM8, DISABLE);

	//enable the PWM output
	TIM_CtrlPWMOutputs(TIM8, ENABLE);
	TIM_Cmd(TIM8, ENABLE);
}

void TIM4_PWM_Config(uint8_t channel, uint16_t prescaler, uint16_t counter) //1, 4, 8 timers PWM
{

//prescaler--;
	counter--;

	GPIO_InitTypeDef GPIO_InitStructure;			//structure for GPIO setup
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;//structure for TIM Time Base
	TIM_OCInitTypeDef TIM_OCInitStructure;	//structure for TIM Output Compare

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);//enable the TIM4 clock
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);	//enable the AHB Peripheral Clock to use GPIOB

	/* Pin configuration */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;

	if (channel == 1)
	{
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_TIM4);//connect the pin to the desired peripherals' Alternate Function (AF) - TIM4 (GPIO_AF_2)
	}
	else if (channel == 2)
	{
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_TIM4);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);
	}
	else if (channel == 3)
	{
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_TIM4);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource8, GPIO_AF_TIM4);
	}
	else if (channel == 4)
	{
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_TIM4);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource8, GPIO_AF_TIM4);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource9, GPIO_AF_TIM4);
	}


	/* Time base configuration */
	//The MCU on the STM32F3-Discovery board is clocked at 72Mhz and we need a 20kHz timebase (50us period)
	//Update_event = TIM_CLK /((PSC + 1)*(ARR   + 1)*(RCR + 1))
	//			 20000 = 72000000/((71  + 1)*(49    + 1)*(0   + 1))

	TIM_TimeBaseStructure.TIM_Prescaler = prescaler; //PSC value; meanse that TIM register will be incremented every 1us (72000000 / (71+1) = 1000000Hz = 1us
	TIM_TimeBaseStructure.TIM_Period = counter; //ARR value - 1; create a time period of 50us (1us * 50 = 50us)
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);

	/* Output Control (OC) configuration - PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;		//configure the PWM
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;

	if (channel == 1)
	{
		TIM_OC1Init(TIM4, &TIM_OCInitStructure);

	}
	else if (channel == 2)
	{
		TIM_OC1Init(TIM4, &TIM_OCInitStructure);
		TIM_OC2Init(TIM4, &TIM_OCInitStructure);
	}
	else if (channel == 3)
	{
		TIM_OC1Init(TIM4, &TIM_OCInitStructure);
		TIM_OC2Init(TIM4, &TIM_OCInitStructure);
		TIM_OC3Init(TIM4, &TIM_OCInitStructure);
	}
	else if (channel == 4)
	{
		TIM_OC1Init(TIM4, &TIM_OCInitStructure);
		TIM_OC2Init(TIM4, &TIM_OCInitStructure);
		TIM_OC3Init(TIM4, &TIM_OCInitStructure);
		TIM_OC4Init(TIM4, &TIM_OCInitStructure);
	}

	TIM_ARRPreloadConfig(TIM4, DISABLE);

	//enable the PWM output
	TIM_CtrlPWMOutputs(TIM4, ENABLE);
	TIM_Cmd(TIM4, ENABLE);
}


void TIM_Config(uint32_t TIM, uint16_t prescaler, uint32_t counter) //2, 3, 4, 6, 7 timers
{

	switch (TIM) {
	case TIM1_BASE:
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
		break;
	case TIM2_BASE:
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
		break;
	case TIM3_BASE:
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
		break;
	case TIM4_BASE:
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
		break;
	case TIM5_BASE:
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
		break;
	case TIM6_BASE:
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
		break;
	case TIM7_BASE:
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);
		break;
	case TIM8_BASE:
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8, ENABLE);
		break;
	default:
		break;
	}

	TIM_TimeBaseInitTypeDef timerInitStructure;
	timerInitStructure.TIM_Prescaler = prescaler - 1;
	timerInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	timerInitStructure.TIM_Period = counter - 1;
	timerInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	timerInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM, &timerInitStructure);
	TIM_Cmd(TIM, ENABLE);
	TIM_ITConfig(TIM, TIM_IT_Update, ENABLE);

	NVIC_InitTypeDef nvicStructure;
	if (TIM == TIM1)
		nvicStructure.NVIC_IRQChannel = TIM1_UP_TIM10_IRQn;
	else if (TIM == TIM2)
		nvicStructure.NVIC_IRQChannel = TIM2_IRQn;
	else if (TIM == TIM3)
		nvicStructure.NVIC_IRQChannel = TIM3_IRQn;
	else if (TIM == TIM4)
		nvicStructure.NVIC_IRQChannel = TIM4_IRQn;
	else if (TIM == TIM5)
		nvicStructure.NVIC_IRQChannel = TIM5_IRQn;
	else if (TIM == TIM6)
		nvicStructure.NVIC_IRQChannel = TIM6_DAC_IRQn;
	else if (TIM == TIM7)
		nvicStructure.NVIC_IRQChannel = TIM7_IRQn;
	else if (TIM == TIM8)
		nvicStructure.NVIC_IRQChannel = TIM8_UP_TIM13_IRQn;


	nvicStructure.NVIC_IRQChannelPreemptionPriority = 0;
	nvicStructure.NVIC_IRQChannelSubPriority = 1;
	nvicStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&nvicStructure);

