Vadim139/ARM/STM32F407/Test_f407/src/STM32F3_my.c
}

void I2C_Config(I2C_TypeDef* I2Cx,uint16_t I2C_Ack)
{
	// GPIO Settings

	GPIO_InitTypeDef GPIO_InitStructure;			//structure for GPIO setup

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;

	switch ((uint32_t)I2Cx) {
		case I2C1_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
			RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
			GPIO_Init(GPIOB, &GPIO_InitStructure);
			GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_I2C1);
			GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_I2C1);
			break;
		case I2C2_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);
			RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
			GPIO_Init(GPIOB, &GPIO_InitStructure);
			GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_I2C2);
			GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_I2C2);
			break;
		case I2C3_BASE:
//			RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C3, ENABLE);
//			RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
//			RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
//			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
//			GPIO_Init(GPIOA, &GPIO_InitStructure);
//			GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_I2C3);
//			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
//			GPIO_Init(GPIOC, &GPIO_InitStructure);
//			GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_I2C3);
			break;
		default:
			break;
		}


	I2C_InitTypeDef I2C_InitStruct;

	/* initialize the I2C_ClockSpeed member */
	I2C_InitStruct.I2C_ClockSpeed = 100000;
	/* Initialize the I2C_Mode member */
	I2C_InitStruct.I2C_Mode = I2C_Mode_I2C;
	/* Initialize the I2C_DutyCycle member */
	I2C_InitStruct.I2C_DutyCycle = I2C_DutyCycle_2;
	/* Initialize the I2C_OwnAddress1 member */
	I2C_InitStruct.I2C_OwnAddress1 = 0;
	/* Initialize the I2C_Ack member */
	I2C_InitStruct.I2C_Ack = I2C_Ack;
	/* Initialize the I2C_AcknowledgedAddress member */
	I2C_InitStruct.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;

//	I2C_Cmd(I2Cx, DISABLE);
	I2C_Cmd(I2Cx, ENABLE);

	I2C_Init(I2Cx, &I2C_InitStruct);
//	I2C_Cmd(I2Cx, ENABLE);
}

void USART_init(void)
{
	  GPIO_InitTypeDef     GPIO_InitStruct;

	  // Enable clock for GPIOA

	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);
	  // Initialize pins as alternating function
	  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
	  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
	  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	  GPIO_Init(GPIOA, &GPIO_InitStruct);

	  USART_InitTypeDef USART_InitStruct;
	  NVIC_InitTypeDef NVIC_InitStruct;

	  /**
	   * Enable clock for USART1 peripheral
	   */
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

	  /**
	   * Set Baudrate to value you pass to function
	   * Disable Hardware Flow control
	   * Set Mode To TX and RX, so USART will work in full-duplex mode
	   * Disable parity bit
	   * Set 1 stop bit
	   * Set Data bits to 8
	   *
	   * Initialize USART1
	   * Activate USART1
	   */

	  USART_InitStruct.USART_BaudRate = 1500000;
	  USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	  USART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	  USART_InitStruct.USART_Parity = USART_Parity_No;
	  USART_InitStruct.USART_StopBits = USART_StopBits_1;
	  USART_InitStruct.USART_WordLength = USART_WordLength_8b;
	  USART_Init(USART2, &USART_InitStruct);
	  USART_Cmd(USART2, ENABLE);

	  /**
	   * Enable RX interrupt
	   */
	  USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);

	  /**
	   * Set Channel to USART2
	   * Set Channel Cmd to enable. That will enable USART2 channel in NVIC
	   * Set Both priorities to 0. This means high priority
	   *
	   * Initialize NVIC
	   */
	  NVIC_InitStruct.NVIC_IRQChannel = USART2_IRQn;
	  NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	  NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	  NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	  NVIC_Init(&NVIC_InitStruct);
}

void puttime(char x, char y, char i, int size,char back, int fcolor, int bcolor) {
	uint8_t godz, min, sek, hsek;
//	lcd_putchar('a');
	PCF8583_get_time(&godz, &min, &sek, &hsek);
//	lcd_putchar('b');
	if (i == 1 || i == 2 || i == 3 || i == 4) {
		LCDSetXY(x, y);
		if (godz <= 9)
		{
			LCDPutChar('0',x,y,size,back,fcolor,bcolor);
			if (size == SMALL)
			y = y + 6;
			else
			y = y + 8;
			LCDPutInt(godz,x,y,size,back,fcolor,bcolor);
			if (size == SMALL)
			y = y + 6;
			else
			y = y + 8;
		} else
		{
			LCDPutInt(godz,x,y,size,back,fcolor,bcolor);
			if (size == SMALL)
			y = y + 12;
			else
			y = y + 16;
		}
		if (i == 2 || i == 3 || i == 4) {
			LCDPutChar(':',x,y,size,back,fcolor,bcolor);
			if (size == SMALL)
			y = y + 6;
			else
			y = y + 8;

			if (min <= 9)
			{
				LCDPutChar('0',x,y,size,back,fcolor,bcolor);
				if (size == SMALL)
				y = y + 6;
				else
				y = y + 8;
				LCDPutInt(min,x,y,size,back,fcolor,bcolor);
				if (size == SMALL)
				y = y + 6;
				else
				y = y + 8;
			} else
			{
				LCDPutInt(min,x,y,size,back,fcolor,bcolor);
				if (size == SMALL)
				y = y + 12;
				else
				y = y + 16;
			}
			if (i == 3 || i == 4) {
				LCDPutChar(':',x,y,size,back,fcolor,bcolor);
				if (size == SMALL)
				y = y + 6;
				else
				y = y + 8;

				if (sek <= 9)
				{
					LCDPutChar('0',x,y,size,back,fcolor,bcolor);
					if (size == SMALL)
					y = y + 6;
					else
					y = y + 8;
					LCDPutInt(sek,x,y,size,back,fcolor,bcolor);
					if (size == SMALL)
					y = y + 6;
					else
					y = y + 8;
				} else
				{
					LCDPutInt(sek,x,y,size,back,fcolor,bcolor);
					if (size == SMALL)
					y = y + 12;
					else
					y = y + 16;
				}
				if (i == 4) {
					LCDPutChar(':',x,y,size,back,fcolor,bcolor);
					if (size == SMALL)
					y = y + 6;
					else
					y = y + 8;

