Vadim139/ARM/STM32F407/Test_f407/src/STM32F3_my.c
					if (hsek <= 9)
					{
						LCDPutChar('0',x,y,size,back,fcolor,bcolor);
						if (size == SMALL)
						y = y + 6;
						else
						y = y + 8;
						LCDPutInt(hsek,x,y,size,back,fcolor,bcolor);
						if (size == SMALL)
						y = y + 6;
						else
						y = y + 8;
					} else
					{
						LCDPutInt(hsek,x,y,size,back,fcolor,bcolor);
						if (size == SMALL)
						y = y + 12;
						else
						y = y + 16;
					}
				}

			}

		}

	}
//	lcd_putchar('c');
}

void putdate(char x, char y, char i, int size,char back, int fcolor, int bcolor) {
	uint8_t mounth, day;
	uint16_t year;

	PCF8583_get_date(&day, &mounth, &year);

//	if (i == 1 || i == 2 || i == 3 || i == 4) {
//		LCDSetXY(x, y);
//		if (day <= 9)
//			lcd_putchar('0');
//		lcd_number(day);
//		if (i == 2 || i == 3 || i == 4) {
//			lcd_putchar('.');
//			if (mounth <= 9)
//				lcd_putchar('0');
//			lcd_number(mounth);
//			if (i == 3 || i == 4) {
//				lcd_putchar('.');
//				lcd_lnumber(year);
////				lcd_puts(' r');
//				}
//
//		}
//
//	}

	if (i == 1 || i == 2 || i == 3 || i == 4) {
		LCDSetXY(x, y);
		if (day <= 9)
		{
			LCDPutChar('0',x,y,size,back,fcolor,bcolor);
			if (size == SMALL)
			y = y + 6;
			else
			y = y + 8;
			LCDPutInt(day,x,y,size,back,fcolor,bcolor);
			if (size == SMALL)
			y = y + 6;
			else
			y = y + 8;
		} else
		{
			LCDPutInt(day,x,y,size,back,fcolor,bcolor);
			if (size == SMALL)
			y = y + 12;
			else
			y = y + 16;
		}
		if (i == 2 || i == 3 || i == 4) {
			LCDPutChar('.',x,y,size,back,fcolor,bcolor);
			if (size == SMALL)
			y = y + 6;
			else
			y = y + 8;

			if (mounth <= 9)
			{
				LCDPutChar('0',x,y,size,back,fcolor,bcolor);
				if (size == SMALL)
				y = y + 6;
				else
				y = y + 8;
				LCDPutInt(mounth,x,y,size,back,fcolor,bcolor);
				if (size == SMALL)
				y = y + 6;
				else
				y = y + 8;
			} else
			{
				LCDPutInt(mounth,x,y,size,back,fcolor,bcolor);
				if (size == SMALL)
				y = y + 12;
				else
				y = y + 16;
			}
			if (i == 3 || i == 4) {
				LCDPutChar('.',x,y,size,back,fcolor,bcolor);
				if (size == SMALL)
				y = y + 6;
				else
				y = y + 8;

				if (year <= 9)
				{
					LCDPutChar('0',x,y,size,back,fcolor,bcolor);
					if (size == SMALL)
					y = y + 6;
					else
					y = y + 8;
					LCDPutInt(year,x,y,size,back,fcolor,bcolor);
					if (size == SMALL)
					y = y + 6;
					else
					y = y + 8;
				} else
				{
					LCDPutInt(year,x,y,size,back,fcolor,bcolor);
					if (size == SMALL)
					y = y + 12;
					else
					y = y + 16;
				}


			}

		}

	}

}



